tap "homebrew/bundle"
tap "homebrew/cask"
tap "warrensbox/tap"

# brew formulaes
brew "coreutils"
brew "go"
brew "detox"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "graphviz"
brew "htop"
brew "hugo"
brew "jq"
brew "protobuf"
brew "warrensbox/tap/tfswitch"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "youtube-dl"
brew "wifi-password"
brew "k9s"
brew "neovim"
brew "mas"
brew "httpie"

# cask formulaes
cask "google-chrome"
cask "spotify"
cask "iterm2"
cask "slack"
cask "1password"
cask "postman"
cask "zoom"
cask "virtualbox"
# cask "minikube"
cask "spectacle"
cask "vlc"